[{"header" : {"descriptor" : "This Weapon Is A", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Warhammer.", "Partisan.", "Javelin.", "Morningstar.", "Halberd.", "Longbow.", "Falx", "Pistol.", "Katar.", "Glaive.", "Crossbow", "Dagger.", "Tomahawk.", "Cestus.", "Greataxe.", "Spear.", "Scythe.", "Musket.", "Flail.", "Ranseur."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Weapons Is Made Of", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["The scrimshawed fang of some great beast.", "Fractally shattered mirror-shards.", "Calcified nightmares washed up from the Starry Sea.", "Damascene steel. Each ripple spells out a prayer.", "Broken hearts stuck together with frozen tears.", "Hollow brass. Within it rages a djinn that long ago went insane.", "The razor-sharp wit of an otherwise foolish warrior-poet.", "Delicately folded origami.", "A fulgurite that still crackles with the lighting that created it.", "A pearl from heaven’s gates.", "Alchemically-treated gold. Its softness, the last of its impurities, has been purged.", "Deftly woven moonlight.", "A seed from the world-tree.", "A sliver of the barrier between the planes.", "The last idol of a forgotten god, melted down and reforged.", "Pure iron quenched in elf-blood.", "Fossilized wizard brains.", "Pitch-black nothing. It is void forced into form.", "Indescribable matter from an aborted reality.", "Flamboyantly coloured coral."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Weapon’s Power Is", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["It can sunder any mundane weapon or armour wielded against it.", "Anyone who holds it can wield it like a master.", "It inspires those who fight alongside its wielder with skill and bravery.", "It can wound the invulnerable and kill the immortal.", "Wounds it inflicts can’t be healed until the weapon’s magic is broken.", "It shines with a baleful radiance that weakens those who stand against its wielder.", "Its blows strike with ferocious impacts, sending foes flying.", "Undoing spells it strikes.", "Those it wounds bleed pure silver.", "Those it kills are bound to serve the wielder as ghosts for three days and three nights.", "It can strike from well beyond the range of a mundane weapon of its sort, with no loss of accuracy. The fabric of space shudders and warps around it as it’s used.", "It spawns minions from the blood it spills.", "It can puncture holes into a pocket dimension which was created with the weapon.", "Any land it kills on becomes bountiful.", "It can strike multiple enemies simultaneously. Possibility smears across its edges.", "It can change size while still being wielded as though it were normal.", "It drains the life of those it wounds and channels that life into the wielder.", "Its wielder can cause anything killed by it to explode.", "It’s hidden from the perception of anyone but the wielder while wielded.", "Its strikes heal instead of wounding. Being healed too much by it causes vile mutations."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Weapon’s Curse Is", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["It cannot harm any descendant of its maker.", "It is bloodthirsty. Once drawn it cannot be sheathed until it has caused a death.", "It is fuelled by joy. Each battle it is wielded, the wielder feels less and less pleasure from the things they enjoy. Those rendered anhedonic by the weapon can no longer even lift it. The process can be greatly accelerated for a temporary boost of power.", "It absorbs the souls of those who wield it when they die. Just giving it away isn’t enough to avert this fate.", "It is the egg of something mighty and terrible. It will hatch if fed with enough violence.", "No food you eat for a day after you draw blood with it will nourish you.", "While you wield it friends and foes are indistinguishable to you.", "It becomes heavier the longer it goes between battles. Go long enough and it will drag you with it down to hell.", "It eats memories that aren’t essential to effectiveness in combat with every swing. Minor memories for most swings, but major ones can be sacrificed for an enhanced attack. If the weapon isn’t swung just roll with it.", "Any child born to its wielder will one day metamorphose into a monster.", "It causes other objects around it to decay.", "Its wielder can’t lie without vomiting serpents.", "You see a figure in the distance, out in the corner of your eye while you wield it. The figure gets closer with each kill. Who knows what they’ll do when they can touch you?", "Your wounds don’t disappear when you heal. They remain as gruesome glamours.", "Any problem solved with the weapon will inevitably result in a worse problem erupting.", "You feel the pain of every wound you’ve ever inflicted with the weapon when you dream.", "Natural animals will loathe you and refuse to abide your presence.", "Its strange energies mutate those nearby when it is not wrapped in the shroud of a saint.", "It will appear in the hands of your worst enemy when you least expect it.", "When you shit, you shit angry geese."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Weapon’s Legend Is", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Lost to history.", "That it was flung far into the future by a lich it was prophesied to one day destroy.", "Its wielders have a tendency to lose their minds to violent rages.", "It will be wielded by the head of the host that will end the world.", "That it was the preferred tool of an infamous serial killer.", "That its first wielder seeks to reclaim it as an undead abomination.", "That it bears a malign will of its own.", "That all who seek it will die by it.", "That it is the prize treasure of a dragon’s hoard.", "That it has a true power that can be revealed by gruelling ritual.", "That a cult desires to destroy it.", "That its curse could be removed by mystical means.", "That it was made as a test for the worthy.", "That it was made as a trap for the unwise.", "It was wielded by a knight who sealed away a powerful demon. The weapon is the key to releasing that demon.", "Present in fragments across several histories.", "Inscribed automagically on the weapon itself as it participates in events.", "Sung by the winds, in accordance with an old treaty.", "Actively censored by some unknown agent.", "Surprisingly upbeat."], "rollBehavior" : "REPEAT"}]