[{"header" : {"descriptor" : "MinorMagicItems2", "dieSize" : 104, "rollsRequired" : 1}, "results" : ["Alchemist Ring - When the wearer of this ring imbibes a healing potion, they receive an additional 2 HP.", "All or Nothing Coin - On a roll you would normally use a 20, flip a coin instead. Heads is a critical success (NAT20), tails is a critical fail (NAT1). Can be used twice per short rest.", "Antigravity Sphere - A small, fist-sized glass ball filled with a silvery smoke. When the sphere is destroyed, it disables the effect of gravity of everything within a 30ft cube for 30 seconds.", "Arcane Trickster’s Glove - Allows a spellcaster who can use Mage Hand to turn the conjured hand invisible. Also allows the conjured hand to perform stealthy actions, such as pickpocketing, sleight of hand, and other acts of remote legerdemain. For these checks, the caster uses their Arcana score.", "Arrow of Celebration - An arrow tipped with an enchanted noisemaker. For 30ft around the impact site, creatures are compelled (WIS vs DC 17) to dance madly. Loud music can be heard 100ft from the impact site.", "Arrow of Displacement - An arrow tipped with a shard of quartz crystal. When it is fired, and the arrow strikes something, the archer is teleported to wherever the arrow landed. The quartz tip breaks after 3 uses and must be replaced.", "Arrow of Yondu - Does not require a bow to use. When the user holds this arrow aloft and whistles, the arrow flies through a target enemy, ignoring AC to do 4 piercing damage. The user continues to roll a 3+WIS, and for every consecutive roll above 15, the arrow shoots through another target the same way. On a failure, the arrow returns to the user’s hand and cannot be used again until after a long rest.", "Assassin’s Bracers - This pair of bracers can contain a concealed dagger within each bracer. The wearer can cause the dagger within one, or both, bracers to extend from the bracer. Extending or retracting the daggers requires the use of a Bonus Action from the wearer.", "Bag of Endless Rats - It looks like a Bag of Holding, but it stinks. All that comes out of it when a character tries to use it are 39 rats. If it is turned inside out or damaged, it disgorges 255 rats and the bag is destroyed.", "Band of the Dryad - A simple wooden band that appears to be entwined by evergreen ivy vines. the top is decorated with a small rose petal, which remains bloomed and perfect until the ring's effect is used. Each day at dawn the petal blooms again. This band has a single charge, which recharges each day at dawn. The power contained within the rose petal may be expended to heal a target the wearer can touch by 9 hit points. Once used, the rose petal wilts and falls off the ring, and this effect may not be used again until the next dawn.", "Belt of Returning - A finely crafted dark leather belt with three loops, each decorated with a shard of sapphire. The magic of the belt leaves an invisible mark on the surface of the weapons stowed in each loop and invisibly inscribes the name of the item on the sapphire shard. Three one-handed weapons with the thrown property can be 'attuned' to the belt. When a weapon, from the belt, is thrown at an object or creature, hit or miss, the weapon will return to the belt at the end of your turn.", "Blanket of Starlight - A soft, well made blanket that can, once per long rest, emit a soft glow, maintained by concentration. The blanket was crafted by an enchanter after his young son confided he was afraid of the dark to help his son get to sleep.", "Bracelets of Bonding - A set of bracelets that when one is broken the other immediately breaks as well. When one is mended, the other mends itself. Created by a brother who was going off to war, for his younger brother staying home. This was so the older brother would know if things got bad at home. If the bracelet snapped, he promised to come home no matter what.", "Bracers of the Woodland Hunter, Uncommon - Once per long rest, you may cast Hunters Mark as a first level spell without using a spell slot. While wearing these, non-magical difficult terrain does not slow your movement.", "Captured Sunlight - Sun-filled mirror-catch box, it has enough sunlight to fill a room with bright light. Built by a retired adventuring dwarf and filled by passing adventurers. Inflicts 3 radiant damage for 120ft every round of combat when placed on the ground, until closed or destroyed.", "Censer of Serenity - An enchanted censer that was made by a daughter for her father, who was suffering from PTSD following the battle that robbed him of his arm. No matter what incense is burned in the censer, it gives advantage on wisdom saving throws.", "Circlet of Mental Fortitude (Requires Attunement) - A copper studded head band that soothes head pain when worn. Made for an elf who suffered from chronic migraines. Grants resistance against psychic damage.", "Circlet of the Planeswalker, Very Rare (Requires Attunement) - While you wear this circlet, you can choose to be considered on your native plane for the effects of banishment and other spells used against you. Whenever you teleport or cross a planar boundary (such as with the Blink spell), you may heal 1 Hit Points.", "Cloak of Death - This garment gives you an undead appearance—a skeletal face crusted with desiccated skin, with black holes for eyes. Gives disadvantage to attacks from undead, because undead creatures are confused by your grotesque appearance. Great for looking like a lich without actually being one.", "Cloak of the Nord - A hooded cloak made of various patches of leather that has a belt fastened to the front. It generates heat on the wearer if blown upon by wind. It was made as gift for a lover so that they could travel the mountain ranges without worry of freezing. Gives resistance against Cold damage.", "Cloak of Vigor - A dark red cloak with an extra long flap in the back that will bend and stiffen into a functional chair when the wearer tries to sit down. Made for a wizard that had difficulty walking across town without breaks. Grants the ability to take a short rest in a fraction of the usual time. 1 use a day.", "Collar of Finding - A leather collar with a small metal emblem of a star on it. A matched bracelet with the same emblem. A person wearing the bracelet can make a small light hover 50 feet above the collar. A wife commissioned this collar after her husband, a retired soldier with significant PTSD, lost the dog that he had bonded with.", "Crown of the False King - A tin crown that increases the confidence and self image of those who wear it. Made for a shy human boy who had trouble talking to people. Grants +2 to Charisma.", "Daryl’s Vest of Haste - A black leather vest with wings painted on the back. This vest gives the wearer advantage on Initiative rolls and +2 to Intimidation rolls, plus proficiency with Crossbows.", "Death Elk Head - The severed, decomposed head of a Giant Elk. It’s been reanimated by necromancy and roars ominously when it makes eye contact with another living being. Choose one creature that you can see within 30 feet of you. If the creature can see or hear the Death Elk Head, it must succeed on a Wisdom saving throw (DC 14) or be frightened of you until the end of your next turn. It holds one charge, and must be recharged by dipping it in fresh blood.", "Demogogue’s Tie - A big red necktie that hangs down to the wearer’s crotch. When worn, the tie causes the wearer’s hair to become pale and wispy, and causes their skin to become orange and leathery. The wearer’s INT is reduced by 3 while wearing the tie and they use the word “tremendous” a lot. When the wearer speaks, everyone in earshot must make a DC 15 WIS save, and everyone who fails will believe whatever the tie-wearer has said, no matter how ridiculous.", "Deodorant Soap - A bar of soap that, when used to wash one’s body, eliminates body odor and grants +1 to Stealth and Persuasion. Lasts for 1 day.", "Dog Whistle - When blown, this whistle makes no noise. 2 rounds of combat later, a dog appears and does 1 thing:", "Pees on the leg of the user, soaking their clothes, and then runs away. Enemies become disgusted and will avoid the user for 3 rounds, only attacking the user if they are attacked.", "Poops on the battlefield and runs away. If anyone steps on the poop, they slip and go prone, and must expend an Action to get back up.", "Serves as an emotional support animal, Inspiring and giving the user +5 on their next roll.", "Distracts the nearest enemy by charging at them and barking, giving the whistle-blower Advantage on their next combat roll against that specific enemy.", "Edible Hat - A hat made of edible fibers--probably cornsilk, but possibly hair. Whatever the material, this is a magic hat that gives the consumer 1 usage of Inspiration if they say out loud, \"If I'm wrong, I'll eat my hat!\" and then eat the hat. Eating the hat takes place over 4 rounds of combat, during which the character can only use Movement or Dodge actions.", "Ethereal Striders - Boots, Very Rare. As your move action you can instead teleport. In order to teleport, choose how far you want to travel, then do an Arcana check. The DC equals 6 for each five feet (1 square) traveled. If you do not succeed on the DC check your teleport fails. Has 3 charges, refills charges every day at dawn.", "Fairy Dragon Coffee - For one round of combat, the drinker’s speed is tripled, they have +5 to AC, they have advantage on Dexterity saving throws, and the character can do 3 Actions. But in the next round, the character takes 1 point of exhaustion.", "Figurine of Wondrous Power: Ruby Chicken - This figurine can become a Large chicken for 24 hours, strong enough to be ridden and carry up to 250 pounds. It has an AC of 10, HP of 22, to-hit of +4, can peck for 4 piercing damage. Has the effect of Featherfall.", "Fire Mephit Lantern - A lantern with a tiny Fire Mephit inside. The Mephit can speak. The lantern casts Light out to 100 feet, and cannot be extinguished.", "Flask of the Fist - When a character imbibes the contents of this flask, they gain 5 damage to their Unarmed strikes for 3 rounds of combat. Empowered strikes also propel Medium or smaller target backwards 20 feet.", "Fletcher’s Mitt - A green glove that allows the user to avoid or catch a projectile. It gives the wearer a +1 AC against all ranged non-magical attacks. If the wearer completely avoids the attack, the user catches the projectile.", "Focus of the Patron, Uncommon (Requires Attunement by a Warlock) - Whenever you cast your Eldritch Blast against an enemy, roll a 11. On a 20, you regain a warlock spell slot. You gain the 1st level patron ability of a patron you do not serve. Example: Awakened Mind while being a Fey Patron warlock. For the effects granted by this ability, you count as a level one Warlock. This functions as an arcane focus.", "Furby of Recording - This toy looks like a tiny fey animal with big creepy eyes. The Furby can store one spell of any level and cast it automonously a given number of minutes later. Any creature can cast a spell of any level into the Furby by reciting the spell while staring into the Furby’s eyes, and then saying how many minutes later they want the spell to active. If the Furby can't hold the spell, the spell is expended without effect. The spell uses the slot level, spell save DC, spell Attack bonus, and Spellcasting ability of the original caster, but is otherwise treated as if you cast the spell. Once the Furby’s spell is expended, it can no longer be used for this purpose, but it will repeat random snippets of dialogue.", "Glove of Magehand - Requires attunement. A magical glove you wear that will immediately conjure a permanent magehand for as long as the glove is worn, which you can use as you'd normally use magehand. You can also punch twice in 1 round of combat for 2 bludgeoning damage. The catch is, the conjured magehand can be attacked or damaged, and any injury inflicted on the magehand will also be inflicted to the wearer’s hand.", "Glutton’s Fork - Once a day, this fork will allow the user to eat any non-magical item they can fit in their mouth and regain 9 HP. Just tap the fork on the item and it will turn edible.", "Grease Grenade - A fist-sized glass ball that spills 24 feet of Grease when and where it shatters.", "Hands of the Knight Initiate, Uncommon - Once per long rest you can cast Bless and Bane each once as a first level spell without using a spell slot. Gain 5 points of lay on hands per long rest.", "Haunted Doll - A very creepy-looking doll. When the owner of this doll fails a third death saving throw, the doll will die in place of its owner.", "Helen’s Earring - An earring that telepathically describes whatever is visible in front of the wearer, whether they can see it or not. Made by a child prodigy for their blind mother who worked tirelessly in order to pay for their magical education. Grants 60ft of Blindsight.", "Holethrower - A plain-looking wooden slingshot with an intricately carved handle. Once a day, this slingshot can fire any unmodified projectile and create a 20-feet-wide circular hole on any non-magical, non-living object or barrier.", "Horn of Hearing - A copper horn that allows the user have advantage to Perception rolls based on hearing when used. Made for an aging grandmother so that she could hear her grandkids better.", "Jack O’Lantern - A carved pumpkin with a candle inside. Projects light in a 10ft radius and dim light in a 30ft radius. Can be used once to summon the Headless Horseman to fight beside you in one battle, whereupon he takes the lantern and leaves with it. If an ally is beheaded in combat, their head can be replaced with the pumpkin to resurrect them with 1 HP.", "Jar of Bees - A jar of bees. The lid is a screen so they can breathe. If thrown up to 50 feet, it will smash and distract enemies with 1 piercing damage for 6 seconds.", "Joshua’s Sandals - A pair of leather sandals that allow the wearer to walk on water.", "Lens of Tracking - A monocle that allows the user to once a day see the footprints of a specific person or creature that has been within the area.", "Les Stroud’s Pocket Guide to Adventuring - Once per day, the owner of this guide may read a section associated with a particular skill to gain Advantage on all rolls relating to that skill for the next 24 hours. The owner may also read the passage out loud to grant one additional party member the same benefit.", "Leviathan Axe - A bearded axe with a mythril blade, inscribed with mystical scrollwork. The handle is made from the arm of a Treant. The axe deals 10 Slashing damage. If thrown, the axe will return to the wielder’s hand in 3 rounds unless grabbed and held with Str against a DC 18. On a nat 20 attack roll, it will also deal 3 Cold damage.", "Lucky Penny - If a player gets a nat 1 on a Perception check, roll 4. On a 4, the character finds a Lucky Penny. The next time they roll a nat 1, they get a reroll and the Lucky Penny becomes a normal copper.", "Mage’s Cravat - A necktie that soothes the throat and allows the wearer to sing / speak for a long time without injuring themselves. Grants resistance against silencing effects.", "Magnetic Charge - A fist-sized metal ball with a button on top. When the button is pressed, the ball will begin to glow and produce a magnetic field that lasts 6 seconds. The field repels any metal objects within 10ft of the ball. Takes 1 day to recharge.", "Masamune’s Instruments - A knife and fork set made from Mithril with small runes embed in the handles. When the fork is inserted into food (non-living material) it allows the knife to cut through it with little to no resistance. Made as a gift from a wife to her husband so that he wouldn’t waste time sawing through her cooking like a log.", "Medallion of the Labyrinth - A medallion that, when focused on, always displays a faint blue line, curving around trees or arching over rocks. It will always show the fastest way home, but not the easiest, a flawed enchantment made by a well-meaning wife for her husband, so that he could always find his way back to her.", "Mimic Coin - When swallowed, this coin will Polymorph the user into a random non-magical item, object, or piece of furniture for 4 hours. The item the user turns into will be roughly the same size category as the user themselves. The item cannot be damaged or transported by any means, magical or otherwise. If touched by a living being’s hand or other forelimb, the user transforms back into their original form.", "Misspell Book - Requires attunement. A book of arcane knowledge that allows the user to use a Reaction to change one letter in the attacker’s magic spell and cause a different effect.", "Mirrors of Clever Seeing - A pair of mirrors. One can see through the other as if there were an extradimensional tunnel between the two. Nothing can pass through.", "Monocle of Farsight - A tin monocle that lets the wearer see a great distance. Made by an artificer that could no longer view the beautiful landscape around his home as he aged. Grants advantage to Perception.", "Orrery of Planes - A small brass claw, meant to be set on a desk and have a gemstone inserted into its top. It gives a small, hologram-like view of an elemental plane, changing which plane is displayed by changing the gemstone. It seems to have been a gift from a noble to his child, as such craftsmanship would be quite expensive.", "Pan of Nostalgia - A frying pan and lid that materializes one fully cooked breakfast platter for one once per day when exposed to flame. Adds 2 temp HP on a long rest. Someone’s mother had it enchanted as a gift for their child who was leaving home so that they could always have a home cooked breakfast.", "Pendant of Sorrows - A music box pendant, that, when wound and played, emits a somber, soothing song, like one sung by a long-dead but much-loved parent to their child. While the song plays, other sound around the wearer is muffled, and the user cannot be frightened.", "Peyote - When ingested, this hallucinogenic mushroom restores one spell slot, but causes the user to hallucinate a random effect from the 52 tables for 2 hours.", "Quill of Desire - A levitating quill that writes out whatever the last person who touched it wants, given that it has enough ink and parchment. Someone’s son had it commissioned after his novelist father lost feeling in both of his hands after a wall collapsed on him.", "Railsplitter - A bearded axe that allows the user to once a day cut down any tree in one swing.", "Resin of Stronmaus, Uncommon - Sweet, viscous tree sap collected from an unknown tree. Smells like pine, perhaps, with the sweetness of mead, and tastes like mead. While it is chewed like gum, this resin imbues the chewer with the Vicious Mockery cantrip, and grants +1 to Charisma.", "Ring of Balance - An emerald ring that gives the wearer an abnormally strong sense of balance. Made for a diplomat by her husband so that when she went on long sea voyages she wouldn’t get sea sick. Grants +1 to Dexterity and Acrobatics skill.", "Ring of the Colonel - Makes the wearer intensely aware of any and all chickens within a 1-mile radius. The ring can allow the wearer to summon 2 chickens to attack an enemy for 1+Cha bludgeoning damage once a day, but it must be recharged by licking all of one’s fingers.", "Ring of the Giantslayer - A plain copper ring that grants the wearer +2 to AC and +2 to attack rolls against any enemy in the “Large” or bigger size categories.", "Ring of the Grammarian - Once a week, the wearer of this ring can alter one letter of one item in an enemy’s equipment to alter its appearance and function. This effect is determined by the DM, but with the ring-bearer’s intentions taken into account.", "Ring of Kinetic Storage -  This simple silver ring allows the wearer to store energy from their body's motions throughout the day, and release it in strong bursts. This ring contains up to 5 charges, the number of charges stored in the ring increases by 1 for every 2 days the ring is worn. As an action, you can make an unarmed strike with the hand the ring is on. This unarmed strike deals an additional 2 bludgeoning damage per charge in the ring. Any unarmed strike with the ring expends all charges stored within the ring. If all five charges of the ring are expended, the target is pushed back 5 feet away from you.", "Ring of Naming - A simple iron ring with 3 charges. Once a day, the wearer can use it to change one letter in an enemy’s name to change their form and function. It can only be recharged by the wearer changing one letter in their own race or class.", "Ring of Quiptical Hits - Two interlocking bands, one gold engraved with a motifs of laughing faces and the other granite with a motif of faces set in stony silence, the ring rewards the witty but punishes japes that fall flat. Once per day, on a successful attack roll, if the wearer can deliver a one-liner, quip or appropriate pun before rolling damage, the attack is converted into a critical hit. However, if the jape is deemed to have fallen flat the wearer is overcome by lethargy and behaves as if affected by the spell slow, until the end of it's next turn.", "Ring of Recall - A small ring that allows the spellcaster wearing it to regain a spell slot after having failed in casting a spell.", "Scarf of Breathing - A red scarf sewn with silver beads into the fabric, magically filters air that is sucked through it when worn as a face wrap. Made as a gift for an obsidian miner to avoid complications with volcano fumes.", "Scrolls of Speaking - A pair of small blank scrolls with matching handles. Whatever you write/draw on one scroll (in ink) appears on the other within 3 minutes. 24 hours after ink touches the blank page, everything written on it melts away permanently. Made by two young Divination apprentices who wanted to keep in touch with each other.", "Scrying Bones - Once per day, these knucklebones can be used to ask a yes, no, or maybe question to the fates (DM). There are three bones carved into happy faces and sad faces. All happy faces mean yes, all sad means no, anything in-between means maybe.", "Spectacles of Elven Reading - A pair of green rimmed spectacles that translates elvish text into common while wearing them. An elf made them so that he and his adopted daughter could read some elvish adventure tomes that he brought home together.", "Stiletto of the Infiltrator, Rare (Requires Attunement) - +1 Dagger, Properties: Finesse, Light, thrown (40/80ft) While wielding this dagger in one hand and a light weapon in the other, you gain a +1 bonus to your armor class. If you impale this dagger in a surface you may, for the next minute, use a bonus action to teleport to its location as long as it is within 100ft of you. Once you use this ability it can not be used again until you finish a short or long rest.", "Strange Key - A big iron key the size of a human forearm. It can either unlock any lock once, whereupon the key shatters, or it can be used to stab one target, ignoring AC and dealing damage equal to 3x the target’s WISDOM, whereupon the key shatters.", "Stronmaus’ Laughing Amulet - The amulet carries the image of a stylized human face, mouth laughing. Whenever a foe is defeated, the wearer may activate the amulet by tapping it twice and then delivering the best taunting joke or victorious one-liner applicable to the current situation. If the jest pleases Stronmaus, he rewards the adventurer by recharging up to 6+Con HP. But Stronmaus is a fickle god; jokes that fail are punished with 4 lightning damage.", "\"Surge\" or Sent's Resonant Gauntlets - Wondrous item, rare (requires attunement by a monk) These soft leather gauntlets are interwoven with wires of copper and precious metal, and you feel a strange hum of energy as you don them. While wearing these gauntlets, your unarmed strike deals an extra 3 lightning damage on a successful hit, and you gain resistance to lightning damage. Additionally, when you are subjected to lightning damage, you can use your reaction to channel the energy through the gauntlets. When you do so, the damage you take is reduced by 7 + your Wisdom modifier + your monk level. If you reduce the damage to zero, you can wield the energy for your own attack. You can spend 1 ki point to make a ranged spell attack with the lightning energy you caught, as part of the same reaction. You make the attack with proficiency, the attack inflicts lightning damage equal to your unarmed strike damage die + your Wisdom modifier, and it has a normal range of 20 feet and a long range of 60 feet.", "Tabard of Rage - A leather Tabard made of orc skin that allows those who wear it to be able to use Rage once per day. Legends tell of the friendship between an elf ranger and an orc barbarian, whose tribe had strange funerary rites. When the orc was struck down, with his final words, he requested that he’d be turned into a tabard so he could protect his friend once more.", "Teapot of Peace - Magical teapot. If anyone is aware of the teapot being poured, they are immediately compelled to sit down and have tea (WIS vs DC 18). Works during combat. It can only be used if full of tea, which must be brewed and steeped normally.", "Ten-Gallon Hat - The 10-Gallon Hat of Hootin' an' Holerin' is a Ordinary looking Cowboy hat with the the words \"Uhh, Yee-Haw?\" Embroidered on the front. Anyone who wears the hat must succeed on a DC 15 Wisdom saving throw or be afflicted with its effects. The hat compels the wearer to Speak in a western accent, Frequently use \"YEE HAW\", will call anyone the wearers knows \"Partner\" and Unknown people \"Stranger', and replace all \"ing\"s with \"in'\"s, even when writing. The hat also can hold 10 gallons of liquid inside an extradimensional space when poured into the hole, much like a bag of holding. The wearer is unaware of any of the hats effects, and the wearer also gains a +3 bonus to charisma checks while being worn.", "Time Grenade - A wind-up clock incased in a glass ball. When a character winds it up and throws it, a sphere of time dilation appears for 30 feet around the target, slowing anything inside to an almost imperceptible crawl for 3 rounds of combat, or 9 seconds. After the effect ends, the clock crashes to the ground and shatters.", "Tome of Resilience - A leather bound tome that writes out motivational quips whenever it is opened. Made for a laborer with low self esteem. Grants the reader advantage on any subsequent roll, once a day, but reading it requires one Action.", "Transmutation Steward, Rare (Requires Attunement) - This small statue appears at first to be a mundane object. If targeted by Detect Magic it registers as highly magical, and if targeted by Identify it reveals its properties. This statue is actually a small semi-sentient creature that awakens upon attunement. Once awakened, it assumes a form of your choice that is small and with challenge rating less than or equal to 1/8. While in this form, it functions as in the Find Familiar spell. If this creature is within 10ft of you, it can jump into your hand and transform into a +1 weapon of your choice. This takes a bonus action on your turn. On subsequent turns it can, as a bonus action, be transformed back into its familiar form or into another weapon form of your choice. If this creature is slain, it reverts back into a statue and recovers over the next 24 hours. After this recovery period, it can then be attuned to again.", "Trapper’s Boots - Tall leather boots that are highly resistant to piercing damage. Made for a hunter who tended to forget where he laid his bear traps.", "The Traveler's Walking Stick, Rare (Requires Attunement) - This staff functions as a +1 Quarterstaff and an Arcane Focus. This staff has 5 charges, and regains 1 charges each dawn. You can spend one charge to deal an additional 4 force damage on a successful melee attack. You can spend 3 charges to Counterspell at 3rd level using your reaction without spending a spell slot. If you successfully Counterspell a spell of 5th level or higher you can add 1 charge to the max charges the staff can hold. The DC to counter a spell of 4th level or higher is 10+ the spell’s level, rolling a 10 + your casting modifier.", "Trueheart Clasp - A small clasp that can be fastened onto the user’s ear, allowing the user to know someone’s true intentions. This gives the wearer Advantage and +2 on all Insight checks.", "Twin Rings of Wonder - requires attunement. If two magic-users wearing these rings high-five as an Action, they can combine their two Spellcasting Ability stats and cast one spell at that level on their next turn. Has 5 charges, can be recharged by heating them with dragonfire.", "Physician’s Pendant - A pendant with a small cross engraved on it. After casting a spell that restores a creature’s hit points, the wearer rolls a 7. On a 17 or higher roll, the healing spell does not cost the user a spell slot.", "Wabbajack - Requires attunement. A gnarled-wood staff that randomly curses one target with a Wild Magic Surge 86 curse randomly rolled by the caster. Causes no damage.", "Water-Repellent Bedroll - A bedroll that creates a mild water repellent barrier around it as long as someone is laying on it. A gift made for a traveling merchant so that he wouldn’t worry about sleeping in the rain. Allows the user to survive in inclement weather without receiving damage.", "Wind Sword - A steel cutlass that resembles a giant feather. Has five charges. One charge can be expended to give one attack a Gust knockback effect of 10 feet, or all five can be expended at once to imbue one attack with 50 foot Gust knockback.", "Wizard’s Dreidel - A wooden top that will keep spinning as long as someone is looking at it. Made to teach concentration to a young boy who had problems focusing on one thing at a time. Once a day, it grants +2 to the user’s spellcasting ability for 4 hours.", "Vest of Buoyancy - A small leather vest enchanted to magically float when exposed to water. Commissioned by a noble after his daughter almost drowned in the estate fish pond.", "Villain’s Cudgel - A well-made wooden club, wrapped in barbed wire. The wood is stained with blood, but you can just make out the word “LUCILLE” on the club’s shaft. 4 bludgeoning damage. Gives advantage to attacks against undead. On a nat 20, the target’s skull is bashed open if the target is a humanoid."], "rollBehavior" : "REPEAT"}]