[{"header" : {"descriptor" : "The altar chamber is lit by", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["A few large candles.", "Many small candles.", "Several candelabra.", "A pair of torches near the entrance.", "Several torches in sconces around the room.", "Lanterns with colored glass (1): 1. green; 2. orange; 3. purple; 4. red.", "Torches that burn with unusually colored flames (1): 1. blue; 2. green; 3. purple; 4. red.", "A large brazier, emitting a dim red glow.", "Only the light you take with you.", "Nothing; this is a dark place, and you have difficulty keeping your torches lit."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Upon approaching the altar, you feel", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["Insignificant.", "A little irritable.", "A little weak.", "Less safe than before.", "An up welling of fear.", "An up welling of hatred.", "A hungry presence.", "A malevolent presence.", "A domineering presence.", "A watchful presence."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "The altar is made of", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["A solid block of stone.", "Three large slabs of stone.", "Three thick cuts of wood.", "A single block of stone carved with disturbing images.", "Three slabs of rune-carved stone.", "Several small stones held together with mortar.", "Brick and mortar.", "Wood carved in the forms of frightening beasts.", "Volcanic glass.", "Bone."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Atop the altar, you find", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["An ancient tome.", "A profane ritual book.", "Several candles.", "A blood-stained parament.", "A singed parament.", "A blanket made from the hide of a great beast.", "A dish (5): 1. bone; 2. brass; 3. gold; 4. ivory; 5. jade; 6. silver; 7. steel; 8. volcanic glass.", "A goblet (7): 1. bone; 2. brass; 3. gold; 4. ivory; 5. jade; 6. silver; 7. steel; 8. volcanic glass.", "A vessel of blood.", "A ceremonial knife."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "You find a prisoner tied to the altar. If you sacrifice a prisoner on the altar,", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["A fiend appears before you and begins savaging you with its claws.", "A fiend appears before you, demanding to know why you've summoned it to this dreary place.", "A fiend presence speaks to you, offering to answer one question you have.", "Nothing happens at first. After a while, you sense a fiendish presence begins watching your every move; you can feel its malevolent gaze.", "An angel appears to smite you for your foul act.", "The victim's corpse rises as a ghoul after 4 minutes, and it seeks you out, hungering for flesh."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "You find a prisoner tied to the altar. If you leave the prisoner there,", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["Someone else kills the prisoner before you come back.", "The prisoner dies of shock, fear, or injuries previously sustained; you discover the corpse when you come back.", "The prisoner screams madly at you to help; the noise is going to draw attention.", "Nothing; that prisoner was worthless.", "When you return, rats are gnawing on the poor prisoner's toes and fingers. The prisoner is screaming and writhing in agony.", "A fiend appears and pulls the prisoner's heart out and consumes the still beating organ as you look on in horror."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "You find a prisoner tied to the altar. If you free the prisoner,", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["The prisoner scrambles away out of the dungeon, terrified of what you may do.", "The prisoner instantly befriends you, desperately wanting to repay you the life-saving favor.", "The prisoner thanks you and tells you where to find a sack full of buried gold if you ever make it out of this hole in the ground; the prisoner then scurries off.", "The prisoner tells you to get out of here because this place is cursed.", "The prisoner tries to stab you with a hidden knife, having actually been a cleverly disguised cultist.", "The prisoner promises to take you on safe paths through the dungeon to visit the terrifying Lord of Deep Places; the prisoner may not be mentally balanced."], "rollBehavior" : "REPEAT"}]