[{"header" : {"descriptor" : "This Demon Looks Like", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["A toad standing on its hind legs, wearing fine raiments. It is haughty, abhors contractions, and enunciates with infuriating precision.", "The howling heads of hoary harridans, tied together by their hair like a cluster of grapes.", "A spider with the face of a goat. Its eight eyes burn with stinking purple flames.", "Burbling slime that shudders and slumps into obscene shapes.", "A flawless marble statue, always weeping blood from one eye and pus from the other.", "The husk of a fly buzzing within the mouth of a skeletal serpent, coiled around the spine of a human skeleton, squatting in the ribs of a hippo skeleton.", "A gnarled, barren tree which drags itself along on its roots. Decorates itself with hanged corpses.", "A flayed dog with hooks and needles woven between its muscle fibers.", "A bomb caught at the moment of explosion, all whirling shrapnel, roiling fire, and wretched screams.", "A worm made of rusted and bloody weapons. Speaks with grinding steel.", "A floating tumour randomly studded with eyes, teeth, and hair.", "An impeccably styled man in black with wriggling maggots instead of teeth.", "A mock-angel: turkey wings sewn to its back, crude iron halo nailed to its skull, tattered and filthy robes, glowing deadly Cherenkov blue.", "A bloated corpse with the rotting head of a pig. Its arms and fingers are far too long, with far too many joints.", "Your tombstone, walking on spiny crab legs.", "A crawling tide of vermin, constantly devouring each other and rapidly breeding more. Speaks in a shrieking chorus.", "A blood-splattered woman with backwards hands and feet.", "The empty, leering hide of an ape. Inside it’s still wet and raw.", "An orgy of tongues carried on an obsidian platter by a faceless butler.", "A towering cyclops with snakes for eyelashes. It wears armour made of chained-together lambs."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Demon Offers", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["To lead its summoner to treasures. Does not warn its summoner of any protections those treasures might have. Hopes to ensnare the souls of the foolish and greedy.", "To take a disease, curse, or injury from you and transfer it to someone more virtuous than you.", "An infernal mount which can outrun any mortal creature, never tires, and can tread across water and atop the tips of trees. If you express any tenderness or mercy where it can see you, the mount will conspire to carry you to your death.", "To blight the fields and herds of your enemies, drive the fish from their nets, and otherwise drag them to destitution.", "To serve as your familiar in animal form.", "To build you a fortress overnight, equipped with many cunning and brutal traps.", "To teach you potent dark magic.", "To smuggle a soul out of hell, and abduct one to there.", "To wipe you from memories and records.", "Connection and influence with various nefarious cults.", "Insider investing tips.", "A weapon that can wound the divine.", "Eternal youth, so long as you bathe every so often in the blood of the innocent.", "A love potion made from the demon’s own putrescent milk. The love it inflicts will gradually sour into obsession.", "To supply you with irresistibly addictive diabolical drugs to deal to others.", "A silk-of-torment shirt that will make you invulnerable to all mortal weapons while you wear it.", "To craft you a perfect, terrible, loyal child from your blood, sweat, and tears.", "To split your tongue and let you tell mind-warping lies.", "To feed you its ichor and make you half-a-demon", "To whisper in your enemy’s ear and lead them to scandal and madness."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Demon Can Be Summoned", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["At a crossroads, under the new moon.", "In a tree split by lightning.", "On the winter solstice.", "Betwixt the eviscerated guts of six sinners. The demon’s offer will be even more powerful than usual.", "Only by the seventh son of a seventh son.", "By howling with a pack of wolves that have tasted human flesh.", "In a pyre of burning holy books.", "Atop the ruin of a desecrated temple.", "Without full knowledge of its ritual, but each step left undone gives the demon a step into your soul.", "Through offerings of cracked bones and crushed marrow.", "Into the body of a crocodile, to stretch from its jaws.", "At the border between hostile nations.", "Underneath a sheet woven by slaves.", "With the sacrifice of a loyal pet.", "From the throat of a strangled hermit.", "By saying its name three times.", "While its summoner is immersed in stagnant water.", "Only while you’re far from any church or temple.", "In an alley where someone was murdered in cold blood.", "By the screams of people in agony from a particular exotic poison."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Demon Prefers", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Summoners who’ve lived a virtuous life.", "To be plied with spoiled wine.", "To punish those who cross it by turning them inside-out.", "Pretending to be another sort of supernatural being.", "Exhaustingly detailed contracts written on comically long scrolls.", "Tearing the heads off things for fun.", "Requests which will weaken the estates of its infernal rivals.", "Keeping a memento from each person who’s summoned it.", "The classic accoutrements: black masses, inverted pentagrams, sacrificial virgins, the works.", "A feast of food stolen from those who couldn’t afford to lose it before getting to business.", "Summoners with a bleak sense of humour.", "Screaming at the sun when it has some spare moments.", "To lie by omissions whenever possible.", "Second-hand sculpture as a hobby, carving other artists’ work into uglier shapes.", "Causing inconvenience and frustration even to its allies.", "Holding millennia-old grudges.", "Deals which amass power for it in the earthly realm.", "Not to be looked at.", "Those who hold royal station, as victims or as summoners.", "To cause people to harm each other rather than get directly involved in violence."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Demon’s Weakness", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Is its own name said backwards, which banishes it.", "Is silver from cutlery which has been used to feed an orphanage.", "Is the fervent prayer of the fanatically faithful.", "Is encoded in the ritual of its own summoning.", "Is a pair of scissors which first cut a baby’s hair. It would inflict grievous wounds on the demon.", "Is woven hair from a loving couple. The demon will be unable to break bonds of it or cross lines of it.", "Is depictions of Fibonacci’s spiral. If the demon sees one, it will have to plod along the line of it from start to finish.", "Is rice grown in holy water. If this is tossed before the demon, it will be compelled to boil every grain before doing anything else.", "Is rockets and fireworks with a martyr’s ashes mixed into their powder.", "Is a sword that’s been beaten into a plough.", "Is the meowing of cats.", "Has a nursery rhyme about it, and so is common knowledge.", "Is knives made from stained glass.", "Has been censored by the demon in a murderous campaign.", "Is that if the demon sees a container with cobwebs in it, the demon is compelled to shrink down and retrieve the cobwebs from it.", "Is slime scraped off medicinal leeches, which acts like poison to the demon.", "Is that it can’t touch anyone with passages of scripture written on them. Having smudged or otherwise blemished scripture on you makes you even more vulnerable to the demon however.", "Was removed from it by a spirit the demon deceived. Only by breaking that bargain can the demon be harmed.", "Is a bouquet of living flowers.", "Is hidden in the mummified heart of its last summoner."], "rollBehavior" : "REPEAT"}]