[{"header" : {"descriptor" : "Roll You find yourself in", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["a graveyard, a blood-red moon hangs above", "the bedroom from your childhood. There is no door to exit the room", "the room you fell asleep in", "absolute darkness. In the silence you can hear your own heart beat", "an open field. Next to you is a dead oak tree with an empty noose swinging in the breeze", "a dark forest. In the corner of your eye you can see something is following you", "a dark cave. A low, rhythmic chanting echoes around you", "a prison cell. The walls are scratched and your fingernails are bloodied", "a long hallway with a door at the end. The door doesn't get closer as you approach", "knee deep swamp water. You can feel something touching your leg under the surface"], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Roll In the [Place] you see", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["a boy/girl", "a young man/woman", "an elderly man/woman", "yourself", "a large dog", "your parents", "a shadowy figure", "a small toy doll, standing upright", "a large wolf, standing on it's hind legs", "a large cat"], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Roll The [Figure]", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["has it's eyes and mouth sewn shut", "is decaying. It's flesh and hair are falling to the ground", "is wheezing loudly. You can feel your throat drying and it gets harder to breath", "blood slowly trickles from the corners of it's mouth, then eyes, and finally it appears to be sweating blood", "its chest bursts open and maggots and worms tumble out, writhing on the floor", "has it's throat slit. You see the wound open and close slightly with it's breathing", "has mismatching limbs. It looks to be sewn together using mismatching pieces", "has the lower body of an arachnid", "has fingernails that continue to grow. They look sharp", "is starting to crumble away as if it were made of ash"], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Roll The [Figure]", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["sprints at you", "begins walking slowly toward you", "throws it's head back and starts cackling wildly", "tries to speak, but spiders begin pouring out it's mouth", "catches fire at it's feet and it quickly spreads up it's body", "vanishes and reappears inches from your face", "grows double it's size and begins chasing you", "grows horrible, black, leathery wings and begins flying towards you", "begins systematically breaking its fingers while staring you in the eye", "starts ripping the flesh from it's face"], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Roll You wake up in a cold sweat", "dieSize" : 10, "rollsRequired" : 1}, "results" : ["inches from your face is the [figure]", "in the darkness you can see the outline of the [figure]", "the [figure] is sprinting towards you, roll initiative. [Player wakes as soon as the figure reaches them. All spells fail and attacks miss against [figure]]", "the door to the room opens slowly and the [figure] walks in", "the party member closest to them is replaced with the [figure]", "standing over you is the [figure]", "as you are about to go to sleep you blink and the [figure] is in front of you", "the [figure] is walking toward you slowly. You cannot move", "the [figure] is dragging away a party member. It looks up and makes eye contact with you", "inside of a new nightmare. Take it from the top"], "rollBehavior" : "REPEAT"}]