[{"header" : {"descriptor" : "Race, This Orc is a", "dieSize" : 4, "rollsRequired" : 1}, "results" : ["Pureblood Orc, thoroughly orcy through and through leading through strength.", "Orog, a particularly intelligent type of orc. Come to lead the warband using its intelligence and tactical skill.", "Orgrillon, half orc and half orge this warlord is massive and strong although simpleminded.", "Half Orc, potentially not from orc society, this half orc has come to lead the warband with its greater intelligence."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Trait. The orc warlord is known because", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["It’s a massive alcoholic. He drinks kegs and kegs of ale every day and demands ale and other drinks as payment.", "He organises feasts made up of the humanoid prisoners. They’re famous throughout the clan and they aim to take as many prisoners in combat for just this reason.", "It’s a fel-orc tainted by fiendish energy in a similar way to a tiefling. Some fiendish powers come from this.", "He killed the previous warlord in a duel, brutally murdering them.", "He pretends to be chosen by the gods and make it seem that he was chosen to lead his clan. He knows this is just fake but everyone seems to believe them.", "He’s blind in both eyes. Strangely, he’s still just as effective in combat.", "He has sired many children and trained both the girls and boys to be terrifying warriors.", "They’re actually happily married to a witch. Although the other orcs find this strange, they’re too terrified of her to question it out loud.", "It plans to organise a raid against the heavens itself! Currently they’re constructing a planar portal to get there.", "Its raids are all against enemies of the orc gods. They think they can hear the gods calling to them and make every choice depending on them.", "It’s known for using biological warfare and disease magic, catapulting diseased corpses into cities.", "It openly is against magic in all forms and aims to hunt down all witches and magic users.", "It kills any orc recruit that doesn’t perform absolutely perfectly.", "It’s a lycanthrope who openly uses this power in combat.", "It openly uses necromancy powers to rise the dead soldiers in combat.", "It’s crippled and needs to use a potion to walk and fight. A secret guarded from the rest of the clan.", "It’s greedy and only cares about money and jewels. Every raid is for more money.", "It’s known as a one man army who has defeated an entire enemy army before single handed.", "It wants to unite all the orc clans nearby into a massive army to take over the entire realm.", "It loves to use alchemy to create powerful weapons of mass destruction and magical potions to make their clan stronger."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Combat. The warlord is known to fight with", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["A huge two handed sword and slow but powerful attacks.", "Death by 1000 cuts. Fast, but tiny attacks with dual daggers.", "A traditional orcish waraxe.", "Shamanistic elemental magic.", "Stealth, trickery and traps.", "A greatbow and magical arrows.", "A crossbow and magical arrows.", "Sword and shield, the shield enchanted with power.", "Warlock like magic.", "Terrifyingly strong blood magic.", "A common usage of potions, for strength and fire breath as well as healing.", "Running away, to live another day.", "Catapults and Artillery.", "A large sharp flail.", "Fists and spiked knuckles.", "Grapples and throwing attacks.", "Extremely loud magical war cries.", "Two large sharp swords.", "A spiked chain weapon.", "A mage assistant who constantly buffs them with magic and healing."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Banner. The orc clan has a banner that shows", "dieSize" : 100, "rollsRequired" : 1}, "results" : ["Wolfs head.", "A skull.", "An animal skull.", "Two axes.", "An axe.", "Two swords.", "Crossed bones.", "A laughing face.", "A fist.", "A dragon.", "A wolf.", "A hanging man.", "The holy symbol of their god.", "An 8 pointed star.", "A moon.", "A claw.", "Several stars.", "A shield.", "A cross pattern.", "A spotted pattern.", "A bloody hand.", "A blood stain.", "A toothy maw.", "Teeth.", "Eyes.", "A dead elf king.", "A boot.", "Several green figures.", "A strange geometric shape.", "A beholder.", "A drake.", "A lion.", "A tiger.", "A shark.", "Waves.", "A volcano.", "A forest.", "A large tree.", "The four forces of nature.", "Fire.", "Water.", "Earth.", "Air.", "An angry face.", "Several different faces.", "Two hands.", "The last warchief.", "A strange twenty sided shape with a 20 on one side.", "A square.", "A triangle.", "Some scribble that looks like a toddler made it.", "A cloud.", "A ghost.", "A skeleton.", "A zombie.", "A river.", "The surrounding region.", "A nude woman.", "A strong man.", "Their god.", "Just black.", "Just red.", "Just white.", "Just green.", "Just blue.", "Just yellow.", "A variance of striped colours.", "Half and half two colours.", "A decapitated head.", "Guts.", "Tusks.", "A fiend.", "An archfiend.", "The area the orcs came from.", "A cliff.", "A tower.", "A fortress.", "A monster.", "Screaming women.", "Gallows.", "Headless people.", "Armour.", "A helmet.", "A spear.", "Two spears.", "Several spears.", "A long spiked sword.", "A bow.", "An arrow.", "A crossbow.", "A cannon.", "A catapult.", "A trebuchet.", "A dark circle.", "A hand print.", "A footprint.", "The symptoms of disease.", "A potion.", "Runic symbols.", "Some face that looks so strangely like the DM."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Soldiers. The Warlords main soldiers and warriors are", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Orc barbarians with swarm tactics.", "Orc Shamans who have strong elemental magic.", "Orc Mage hunters who have wards to protect them from magic.", "Powerful orcs who have been engineered and trained from birth to know nothing other than war.", "Orc Knights with full armour.", "Orc Assassins.", "Orc archers and rangers who attack from afar.", "Orc monster hunters prepared to take down massive prey.", "Orog soldiers who use superior tactics.", "Orc riders who ride wargs dire wolves and horses.", "Orges who crush and destroy anyone needed.", "Hobgoblin mercenaries used for the most dangerous jobs.", "Ogrillion barbarians and beserkers.", "One amazingly strong and talented orc who can take on massive beasts with ease.", "Half Orcs who follow their orcish side more.", "Orc artillery experts who use catapults and cannons.", "Orc warlocks who have made a pact with fiends for more power.", "Amazonian she-orcs.", "A swarm of young orcs wanting to prove themselves in battle.", "Orc monster handlers who control massive drakes and similar creatures."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Minions. The orcs army also has", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Goblins who are used as cannon fodder.", "Kobolds convinced with small amounts of gold.", "Goblins who are wired with explosives.", "Orc peasants attacking with simple weapons.", "Prisoners brainwashed to fight for the orcs.", "Simple orc warriors.", "A clumsy ogre", "A pack of allied gnolls", "Packs of wargs", "Packs of dire wolves.", "A tamed Wyvern.", "A very powerful orc wizard.", "A small fleet of galleys and sailboats.", "A young dragon who assists them.", "Swarms of giant insects assisting them.", "Conjured elementals.", "Hobgoblin mercenaries.", "Bugbear mercenaries.", "A small family of trolls helping them.", "Undead risen to assist the clan."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Base. The clan is based out of", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["A small shamanistic orc village.", "A massive orc keep with multiple traps and defences such as boiling oil.", "A fortress on the back of a dire mammoth.", "A dragons old abandoned lair.", "A conquered village/town of their enemies.", "A forest camp.", "A camp in the tundra.", "A walled off stronghold originally made to be temporary.", "A huge pit mine with furnaces and smelters making weaponry.", "A solitary island with a shipyard.", "A huge orcish city.", "The bones of a titan or a dragon.", "A cavern in a cliff.", "A riverside.", "A coastal cliff.", "A muddy bog.", "A nomadic camp they can put up in hours.", "The middle of the plains.", "A mountainous camp made of rock.", "Somewhere original created to imprison them."], "rollBehavior" : "REPEAT"}]