[{"header" : {"descriptor" : "This Wizard Dresses", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["In drapes of their own loose skin.", "In elaborately braided scalps.", "With inappropriate lewdness.", "In a robe made from the canvases of priceless paintings.", "In smeared bog-mud and poultices.", "Unnervingly normally.", "Centuries out of fashion.", "In clanging brass plates embossed with astrological signs.", "In rotting, untanned hides.", "In a filtration suit that removes impurities from their environment.", "In impractically tall hat and shoes.", "In a delicate confectionery-sculpture.", "In living plants bent around them.", "In a thick cloud of incense that hovers around them.", "In dripping candles and wax that encases their body.", "In clamouring chains of bells.", "In a coat sewn from gold coins.", "In symbiotic fungus growing from their skin.", "In incomprehensible haute couture.", "In rags and junk they’ve stuck together."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Wizard Casts Spells", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["By scrabbling signs in the dirt with their walking stick.", "By hawking a loogie at the target of their magic.", "With a wand carved from their own ulna.", "By making arcane gestures with their toes.", "With harsh caterwauling.", "By whipping bloody sigils into their own back.", "By eating the pages out of a grimoire.", "By popping iridescent boils on the backs of their slaves.", "By smashing expensive pottery painted with magic formulae.", "By dancing a jerky jig.", "By glaring with their evil eye, which is grotesquely bloodshot and three times larger than their good eye.", "By blaring abominably on a set of trumpets.", "With a turnspit dog running in a prayer wheel.", "With joint-dislocating yoga poses.", "By rolling bone figurines.", "By throwing handfuls of pigmented dust into the air, kept in toad-belly and rhinoceros-scrotum bags when not in use.", "With a needle-fork that jabs and goads reality into bending to the wizard’s will.", "By doing ungodly amounts of psychedelic drugs and communing with the otherworld.", "By whispering to shrunken heads that then shriek out the incantations.", "By standing still while their shadow stretches and deforms into occult shapes."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Wizard Can", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["Pluck your organs out like they’re picking an apple.", "Send their reflection out into the world to wreak mischief.", "Say different things to different people simultaneously, without any of them realizing it.", "Speak the language of birds, and trade them worms for secrets.", "Induce nightmares by whistling.", "Command creatures by nursing them from a third nipple. Their third nipple is: 1, in an armpit; 2, on the end of a finger; 3, atop a buttock; 4, beneath their tongue; 5, on a knee; 6, between their shoulderblades.", "Smell lies.", "Make their hands float separate from their body.", "Learn another wizard’s spells by eating their brain.", "Curse a farmer’s field with infertility by burying a special stone in it.", "Fly about by pulling a noose around their neck.", "Vomit a torrent of knives.", "Tell sanity-blasting jokes.", "Repel weapons that haven’t spilled the blood of the innocent.", "Discern the location of anyone whose hair they hold.", "Boil the youth out of children.", "Mold metal like clay.", "Animate household objects to perform chores and assault intruders.", "Interact with illusions as if they were real.", "Ferment anything into alcohol."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Wizard Believes", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["That cats plot their downfall.", "That bathing washes away the magical residue necessary for spellcasting.", "That they must serve whoever can guess their name.", "It’s lucky to perform everything backwards. Talking. Walking. Putting on clothes. Etc.", "That everyone is a puppet controlled by signals beamed down by the stars.", "That mixtures including mercury and lead are the key to perfect health.", "That happiness opens you up to possession by malign spirits.", "That flowers are obscene and should all be veiled from sight and scent.", "That good and evil are entirely subjective.", "That each baby born shortens the life of those already living.", "That magic is granted by chastity.", "That letting one’s feet touch the ground is deeply shameful.", "That literacy is a sign of weakness.", "That they’re the only conscious being in a world full of philosophical zombies.", "That things stop existing when the wizard doesn’t perceive them.", "That their parents’ ghosts are judging their every action.", "Everything is really made of water.", "That they invented the question mark and are entitled to royalties for its use.", "Gravity is the invisible webs of transparent spiders.", "Everything has a price and you need only find the right market for it."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "This Wizard Wants", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["To escape into a more fundamental reality.", "To disprove the gods.", "Immortality.", "To humiliate an old romantic rival.", "To claim ownership of the sun.", "To discover the first language.", "To create their own world.", "To invent a cure for sin.", "To measure and compare the weights of souls.", "Someone to take their place in the bargain that traded their soul away.", "Proof that they are the rightful ruler of the land.", "The location of a lost city of wizards.", "To build a staircase into the underworld.", "Funding for their latest project.", "Critical acclaim for their poetry.", "To marry the most beautiful being in the world.", "A servant who will never betray them.", "To unite the people of the world into one hivemind.", "To release an ancient evil.", "To end abstract thought."], "rollBehavior" : "REPEAT"}]