[{"header" : {"descriptor" : "Foliage: The plant life is", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["green, waving grass, several feet high.", "Short tight grass clumps intermingled with shrubbery.", "Yellowish grass that grows low to the ground, with the occasional tree growing by itself.", "Sparce, with only clumps of dark green and brown scrub brush every few yards.", "Groves of trees growing every few hundred yards among tall grasses, as if nature(or someone) is trying to seed a forest.", "Briar patches and mildly poisonous plants that have choked out most of the other plant life."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Perception fodder: You notice", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["the sun becomes obscured by the clouds.", "a well used animal trail.", "a hawk flying high overhead.", "the croaking of frogs at a nearby water source.", "small mammals playing/fighting loudly that suddenly grow silent and disappear as you approach.", "a light breeze blows, carrying the scent of wood smoke.", "a strong wind gusts, carrying the sound of thunder and scent of approaching rain.", "the faint thumping of drums in the distance.", "a plume of smoke on the horizon.", "the buzzing and singing of insects hidden in the foliage.", "the scent of death and decay.", "a sickly sweet smelling flowered bush.", "a sudden gust of wind brings a strange smell, but it fades quickly as the wind dies down.", "the faint rattling of a serpent's tail nearby.", "the chirping of a flock of small birds that takes the air when you approach.", "a trail of fresh blood.", "a mound of loose earth, as if something was recently buried.", "a swarm of insects buzzing loudly around a dead animal.", "a faint rumbling in the ground that stops after a moment or two.", "a nearby boulder covered with a swarm of ants. A busy day in the anthill, indeed."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Interesting locations: You come across", "dieSize" : 20, "rollsRequired" : 1}, "results" : ["several standing stones on top of a hill and arranged in a strange design.", "an ancient monolith constructed of a material not found native in the area.", "a rushing stream that snakes its way across the plains.", "a large watering hole used by numerous forms of wildlife.", "a rocky cave opening jutting out of the ground.", "a group of indigenous nomads, stopping for a time before continuing their journey.", "a village of settlers from a nearby civilization.", "a series of sink holes that drop several hundred feet into the earth.", "the ruins of a long abandoned military outpost/fort.", "a lone tree with several skeletons dangling from nooses.", "a makeshift quarry dug into the ground where large chunks of stone have been cut out and chiseled into statues.", "a lone gravestone. Large, but sunken into the ground. The engraving is in a language not spoken in this region.", "a low swampy area, full of foul smelling water and brightly colored flowers.", "a huge boulder sitting alone in a field. Into the sides are scrawled all kinds of glyphs, most partially worn away by time.", "a tall hill or cliff, standing several hundred feet higher than the surrounding terrain. You can see for miles from the top.", "a stone well, recently used by a group of herdsmen, their livestock having left tracks nearby.", "a forgotten stone tower, collapsing from the ravages of time.", "a fairy ring, several feet in diameter, with a statue of two elves dancing in the center.", "a large Elven hunting lodge, a fine roof and floor with no walls. Some elven hunters meditate inside while the rest hunt in the plains.", "a religious shrine in disrepair. It bears a map of all points on a long forgotten pilgrimage."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "What are the standing stones used for?", "dieSize" : 8, "rollsRequired" : 1}, "results" : ["Druidic conclave meetings.", "Pagan sacrifices or rituals.", "necromantic summonings.", "devil summonings.", "political gathering of tribes.", "seasonal feasting.", "duels of honor, often to the death.", "religious rites and offerings to a deity."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "What's up with the monolith?", "dieSize" : 8, "rollsRequired" : 1}, "results" : ["Pulses of magic emanate from it, felt by any magic sensitive creatures (including players) nearby, drawing them to touch it.", "It casts a shadow the doesn't move with the sun. At night, the \"shadow\" is actually brighter than the ground.", "Its surface is covered in strange runes that shift about when inspected, inducing a headache.", "Magic does not work in its immediate vicinity, and acts strangely while cast within line of sight.", "The pieces of the monolith can be shifted and turned in a number of ways, yet it somehow always seems to look the same.", "A faint, very deep, humming can be heard emanating from inside it. Almost so low as to be a vibration, rather than a sound. Induces nausea if one is exposed for too long.", "Wildlife that approach within twenty feet of it seem to simply tip over and die, as demonstrated by the ring of old and new corpses surrounding it. Humanoids seem to be unaffected.", "Certain objects and colors seem to glow with an unnatural brilliance when near the monolith. (Treat the effect as a black light. White items, and other brightly colored things, glow strangely)"], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "What lives in the rocky cave?", "dieSize" : 8, "rollsRequired" : 1}, "results" : ["a slightly unhinged hermit.", "a pack of wolves.", "a minotaur, the entrance to its labyrinth camouflaged as a cave.", "a tribe of troglodytes.", "an exiled Deep Gnome.", "a feral child, raised by local fauna.", "a retired trapper, living out his final days.", "Nothing near the surface, but the cave goes deep. Very deep."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : ". Who are the nomads?", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["a tribe of centaurs, wary of outsiders.", "a family of gypsies, heading for a nearby town or city.", "Livestock herders, on their way to new grazing land as the season changes.", "a caravan of traveling merchants, making the very long, but very profitable, journey to a far off land.", "a small band of doppelgangers, posing as a hunting party.", "a village of halflings, driven from their home."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "What's under the sink holes?", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["an abandoned mine.", "the ruins of a village, swallowed by the earth.", "an ancient temple to a pagan deity.", "an underground river, flowing into the deep.", "an ankheg colony.", "a massive cave network."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "What is in/under the lone tree?", "dieSize" : 6, "rollsRequired" : 1}, "results" : ["a group of will-o-wisps.", "a vain banshee.", "a green hag, ready to strike a bargain.", "a transplanted colony of pixies and sprites, hoping to seed a new forest.", "a grumpy giant badger.", "a swarm of giant wolf spiders."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Wildlife Encounters(neutral): You encounter", "dieSize" : 12, "rollsRequired" : 1}, "results" : ["a large cat apathetically watching you, well camouflaged against its native terrain.", "several large snakes that slither off into the brush when you get too close.", "a herd of bison, grazing lazily.", "a family of ground rodents that watch you curiously from the safety of their burrow entrances.", "a pack of coyotes out for a meal.", "wild hogs rooting in the ground.", "a herd of elephants/woolly mammoth.", "a fat, ambling bear.", "a herd of wild horses stampeding across the plains.", "a flock of ground fowl, loudly protesting as you approach their nesting area.", "a lone crow watching as you pass by. It hops after you a few steps at time to get a better look and then flies away, cawwing loudly.", "a rhinoceros, taking a dust bath."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Enemy Encounters: You come upon/are beset by: (challenge rating ~2-6", "dieSize" : 12, "rollsRequired" : 1}, "results" : ["a bandit raiding party.", "an ankheg ambushing you from below!", "a small flock of cockatrice(s?).", "a hobgoblin patrol.", "a trio of motionless scarecrows near an abandoned cottage.", "a wandering ogre.", "a hungry Manticore.", "same as #4 plus a Hobgoblin captain.", "a raging bull elephant.", "a burrowing Bullette.", "a soaring Chimera.", "a shambling cyclops."], "rollBehavior" : "REPEAT"}, {"header" : {"descriptor" : "Friendly encounters: You cross paths with", "dieSize" : 12, "rollsRequired" : 1}, "results" : ["an explorer, heading out into the unknown wilds.", "a surveyor, marking landmarks and distances on a map in the wake of an explorer.", "a miner, coming back to civilization with many valuables and oddities to sell.", "an artist, pursuing their inspiration in the wilderness.", "a grizzled old veteran, looking for their final battle.", "an elderly druid, preparing a ritual to perform during an upcoming astral event (solstice, equinox, eclipse, etc).", "a nomadic tribe of centaurs traveling across the plains.", "an acolyte of a nature deity, undergoing a pilgrimage.", "a noble and their entourage, returning from a big game hunt.", "a tribal warrior, returning to their village from a successful hunt.", "a bounty hunter, tracking a fugitive.", "a revenant, tirelessly making its way back to civilization to exact its ultimate revenge."], "rollBehavior" : "REPEAT"}]